[
  {
    "role": "Software Developer",
    "organisation": "Electric Mind",
    "startDate": "Aug. 2024",
    "endDate": "Present",
    "experiences": [
      "Refreshed a legacy Angular dashboard and built a platform-wide search feature for an RBC IS client portal.",
      "Resolved a major performance bottleneck, cutting load times from 20s to under a second across platform apps.",
      "Built a Master Data Management system for an insurance broker to automate data ingestion, cleansing, and approvals.",
      "Designed an automated schema deployment framework to streamline database migrations to improve a client's deployment efficiency."
    ],
    "imageSrc": "history/electricmind.png"
  },
  {
    "role": "Software Developer Co-op",
    "organisation": "Royal Bank of Canada",
    "startDate": "Jan. 2023",
    "endDate": "Apr. 2023",
    "experiences": [
      "Maintained Spring Boot APIs supporting mainframe verification and transactions across 4000+ RBC ATMs.",
      "Fixed 22 critical Maven-related security vulnerabilities in the codebase ahead of schedule.",
      "Migrated legacy Spring Boot apps from Java 8 to Java 17 by updating code syntax and dependencies."
    ],
    "imageSrc": "history/rbc.png"
  },
  {
    "role": "Software Engineer Co-op/Part-Time",
    "organisation": "University Health Network",
    "startDate": "Jan. 2022",
    "endDate": "Dec. 2022",
    "experiences": [
      "Improved team productivity by creating reusable Python scripts to automate clinical report generation.",
      "Built an automated ETL pipeline in pandas to transform clinical survey data into a standardized format for visualization.",
      "Redesigned a legacy WordPress site with a modern tech stack and UX to boost user engagement."
    ],
    "imageSrc": "history/uhn.png"
  },
  {
    "role": "Teaching Assistant",
    "organisation": "University of Toronto",
    "startDate": "Sept. 2022",
    "endDate": "Aug. 2024",
    "experiences": [
      "Courses: CSCC09, CSCC01, CSCB07, MATA32, MATA33, MATA34, MATA36",
      "Mentored 30+ students weekly in Computer Science and Software Engineering fundamentals, focusing on Java, React, and Node.js."
    ],
    "imageSrc": "history/uoft.png"
  }
]
