[
  {
    "role": "Software Developer",
    "organisation": "Electric Mind",
    "startDate": "Aug. 2024",
    "endDate": "Present",
    "experiences": [
      "Developed a Master Data Management system for an insurance broker using Django, SQL, & Azure, automating data ingestion, cleansing, and role-based approvals, reducing the client's data management overhead by 40%.",
      "Designed and implemented an automated schema deployment framework with Liquibase and Azure DevOps, streamlining SQL schema changes across environments and improving the client's deployment efficiency by 30%.",
      "Engineered an AI calling agent for automating fleet service appointments reducing the client's staff overhead by 35%.",
      "Researched and presented design-to-code tools from Figma to React, potentially cutting the company's POC-to-handoff time by 50% and reducing dev resources by 25%.",
      "Built and deployed an internal developer portal on top of Backstage by Spotify, including software catalogs, templates, and plugins, accelerating the company's developer onboarding process by 2x."
    ],
    "imageSrc": "history/electricmind.png"
  },
  {
    "role": "Software Developer Co-op",
    "organisation": "Royal Bank of Canada",
    "startDate": "Jan. 2023",
    "endDate": "Apr. 2023",
    "experiences": [
      "Enhanced existing SpringBoot APIs powering mainframe verification and transactions at over 4000 RBC ATMs.",
      "Investigated and resolved 22 critical security vulnerabilities in the codebase caused by specific Maven dependencies, twice as fast as estimated by the manager.",
      "Performed successful migration of legacy SpringBoot applications from Java 8 to Java 17 by rewriting incompatible code components into new syntax and updating sub-dependencies."
    ],
    "imageSrc": "history/rbc.png"
  },
  {
    "role": "Software Engineer Co-op/Part-Time",
    "organisation": "University Health Network",
    "startDate": "Jan. 2022",
    "endDate": "Dec. 2022",
    "experiences": [
      "Developed an automated ETL pipeline to transform custom clinical survey results into a normalized data model in pandas to enable standard data visualization practices.",
      "Proactively increased the team’s productivity by writing reusable scripts for generating clinical result reports.",
      "Commended by the team’s manager for exceeding expectations and invited back as a part-time Python developer."
    ],
    "imageSrc": "history/uhn.png"
  },
  {
    "role": "Teaching Assistant",
    "organisation": "University of Toronto",
    "startDate": "Sept. 2022",
    "endDate": "Aug. 2024",
    "experiences": [
      "Courses: CSCC09, CSCC01, CSCB07, MATA32, MATA33, MATA34, MATA36",
      "Conducted weekly tutorial sessions with over 30 students covering concepts in software engineering, object oriented programming and web development using Java, ReactJS, Node.js, etc."
    ],
    "imageSrc": "history/uoft.png"
  }
]
